app/controllers/comments_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "comments" ("content", "message_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "i can help u!!"], ["message_id", 5], ["created_at", "2016-12-20 09:19:16.541191"], ["updated_at", "2016-12-20 09:19:16.541191"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 2], ["updated_at", "2016-12-20 09:19:16.630239"], ["id", 1]]
---
  def create
    @message = Message.find(params[:message_id])
    @comment = @message.comments.create(comment_params)
    @comment.user_id = current_user.id
    if @comment.save

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "i can help u!!!"], ["updated_at", "2016-12-20 09:43:56.901619"], ["id", 1]]
---
  def update
    if @comment.update(comment_params)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 5]]
---
  def find_message
    @message  = Message.find(params[:message_id])

SELECT  "comments".* FROM "comments" WHERE "comments"."message_id" = ? AND "comments"."id" = ? LIMIT 1  [["message_id", 5], ["id", 1]]
---
  def find_comment
    @comment = @message.comments.find(params[:id])