app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages"  ORDER BY created_at DESC
---
  def index
    @messages = Message.all.order("created_at DESC")

UPDATE "messages" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "messages"."id" = ?
---
  def update
    if @message.update(message_params)

INSERT INTO "messages" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @message = current_user.messages.build(message_params)
    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", 2]]
---
    def find_message
      @message = Message.find(params[:id])